dictionary_data = {
  characters: {
    hiragana: [
      "あ", "え", "う", "い", "お", 
      "か", "き", "く", "け", "こ",
      "さ", "し", "す", "せ", "そ",
      "た", "ち", "つ", "て", "と",
      "な", "に", "ぬ", "ね", "の",
      "は", "ひ", "ふ", "へ", "ほ",
      "ま", "み", "む", "め", "も",
      "や", "ゆ", "よ", 
      "ら", "り", "る", "れ", "ろ",
      "わ", "お", "ん"
    ]
    katakana: [
      "ア", "エ", "ウ", "イ", "オ",
      "カ", "ォ", "ク", "ケ", "コ",
      "サ", "シ", "ス", "セ", "ソ",
      "タ", "チ", "ツ", "テ", "ト",
      "ナ", "ニ", "ヌ", "ネ", "ノ",
      "ハ", "ヒ", "フ", "ヘ", "ホ",
      "マ", "ミ", "ム", "メ", "モ",
      "ヤ", "ユ", "ヨ",
      "ラ", "リ", "ル", "レ", "ロ",
      "ワ", "オ", "ン"
    ]
  }
  colors: [
    ["red", "あか"]
    ["yellow", "きいろ"]
    ["black", "くろ"]
    ["white", "しろ"]
    ["blue", "あお"]
    ["purple", "むらさき"]
    ["green", "みどり"]
  ]
  foods: [
    ["apple", "りんご"]
    ["strawberry", "いちご"]
    ["peach", "もも"]
    ["banana", "バナナ"]
    ["pear", "なし"]
    ["watermelon", "スイカ"]
    ["lemon", "レモン"]
    ["persimmon", "カキ"]
    ["pineapple", "パイナップル"]
  ]
}
